
[
  {
    "system_id": "A",
    "system_title": "Propulsion",
    "tables": [
      {
        "table_id": "3",
        "system_code": "A0",
        "title": "Propulsion, General",
        "subsystems": [
          {
            "subsystem_code": "-00",
            "title": "General",
            "definition": "A system or equipment for producing and delivering power."
          }
        ]
      },
      {
        "table_id": "4",
        "system_code": "A1",
        "title": "Power pack - General",
        "subsystems": [
          {
            "subsystem_code": "-00",
            "title": "General",
            "definition": "The power pack element refers to a self-contained means for generating and delivering power. It includes such systems as the main engine, transmission and interfaces. Subsystems can include such items as cooling, fuel, air and exhaust, lubrication, auxiliaries and electrical."
          },
          {
            "subsystem_code": "-10",
            "title": "Main engine",
            "definition": "Refers to a diesel, petrol, electric, etc, fuelled means for generating power and a means whereby this power can be delivered to the transmission. It can include, for example, engine mounted flywheel and clutch assemblies, cooling, fuel, air and exhaust, lubrication, auxiliary and electrical systems."
          },
          {
            "subsystem_code": "-20",
            "title": "Transmission",
            "definition": "Refers to a system which transmits power from the engine to the driving member and can include torque converter and gearbox. It can also include flywheel and clutch assemblies, steering and brakes if they are integral to the transmission. Also included are differentials and power takeoffs."
          },
          {
            "subsystem_code": "-30",
            "title": "Power pack Interfaces",
            "definition": "Refers to the mounting assemblies connecting the main engine and transmission, together with associated ancillaries, including such systems as cooling, fuel, air and exhaust, lubrication, auxiliary and electrical. It can also include transmission items."
          }
        ]
      },
      {
        "table_id": "5",
        "system_code": "A2",
        "title": "Power unit, General",
        "subsystems": [
          {
            "subsystem_code": "-00",
            "title": "General",
            "definition": "The power unit element refers to a discrete means for generating and delivering power to the transmission. It can include, for example, flywheel and clutch assemblies."
          },
          {
            "subsystem_code": "-10",
            "title": "Engine",
            "definition": "Refers to a diesel, petrol, electric, etc, fuelled means for generating power and a means whereby this power can be delivered to the transmission. It can include, for example, flywheel and clutch assemblies and engine mounted cooling, fuel, air and exhaust, lubrication, auxiliary and electrical systems."
          },
          {
            "subsystem_code": "-20",
            "title": "Cooling system",
            "definition": "Refers to systems designed to maintain the correct operating temperatures for the power unit. It includes, for example, cooling air ducting, coolant pumps, liquid filled radiators, intercoolers, fans and associated heat exchange equipment."
          },
          {
            "subsystem_code": "-30",
            "title": "Fuel systems",
            "definition": "Refers to a system or equipment designed to deliver fuel to the power unit. It includes, for example, fuel storage facilities, pumps, filters, delivery pipes, drainage and cut-off valves, Fuel Injector Pumps (FIP) and injectors."
          },
          {
            "subsystem_code": "-40",
            "title": "Air and exhaust systems",
            "definition": "Refers to a system which supplies air to, or collects and removes exhaust gasses from the engine. It includes, for example, all pipes, ducting, filters, couplings, gaskets, turbochargers/superchargers, silencers and catalytic converters."
          },
          {
            "subsystem_code": "-50",
            "title": "Lubrication systems",
            "definition": "Refers to a system that provides lubrication to the power unit and any external components related to the power unit lubrication system. It includes, for example, delivery and return pipes, pumps, filters, intercoolers and separately mounted heat exchangers."
          },
          {
            "subsystem_code": "-60",
            "title": "Electrical",
            "definition": "Refers to a system that provides or uses electrical power associated with the power unit. It includes, for example, starter motors, alternators and generators directly mounted on the power unit. It also includes, for example, ignition system components including spark plugs, distributor, coils and leads."
          },
          {
            "subsystem_code": "-70",
            "title": "Ancillary",
            "definition": "Refers to ancillary controls, items and associated systems in, or directly mounted on, the power unit. It includes, for example, engine mountings."
          },
          {
            "subsystem_code": "-80",
            "title": "Hydraulic",
            "definition": "Refers to a system that provides or uses hydraulic power associated with the power unit. It includes, for example, hydraulic pumps, valves, pipes, and tanks. It also includes any external components related to the power unit hydraulic systems."
          }
        ]
      },
      {
        "table_id": "6",
        "system_code": "A3",
        "title": "Engine cooling system, General",
        "subsystems": [
          {
            "subsystem_code": "-00",
            "title": "General",
            "definition": "This system includes cooling air ducting, coolant pumps, liquid filled radiators, fans and associated heat exchange equipment mounted externally to the power unit/pack."
          },
          {
            "subsystem_code": "-10",
            "title": "Fluid",
            "definition": "Refers to fluid (water/oil) filled coolant systems. It includes pumps, radiators, fans, pipes and associated heat exchange equipment."
          },
          {
            "subsystem_code": "-20",
            "title": "Air",
            "definition": "Refers to cooling air ducting, fans and associated heat exchange equipment."
          }
        ]
      },
      {
        "table_id": "7",
        "system_code": "A4",
        "title": "Fuel systems, General",
        "subsystems": [
          {
            "subsystem_code": "-00",
            "title": "General",
            "definition": "Equipment to provide fuel storage facilities, filters, delivery pipes, drainage and cut-off valves, Fuel Injector Pumps (FIP) and injectors mounted externally to the power unit/pack."
          },
          {
            "subsystem_code": "-10",
            "title": "Storage",
            "definition": "Refers to the portion of the system which stores fuel. It includes, for example, tanks, filler necks, seals, valves, vents and drainage."
          },
          {
            "subsystem_code": "-20",
            "title": "Distribution",
            "definition": "Refers to the portion of the system which is used to distribute fuel from the storage system. It includes, for example, filters, restrictors, valves, controls and pipes."
          },
          {
            "subsystem_code": "-30",
            "title": "Priming",
            "definition": "Refers to the portion of the system which is used to pressurize/pump the fuel. It includes, for example, lift pumps, pressurization pumps, and cold starting systems."
          },
          {
            "subsystem_code": "-40",
            "title": "Fuel injection",
            "definition": "Refers to the portion of the system which delivers fuel. It includes, for example, FIP, fuel injectors, fuel pump metering and carburetors."
          },
          {
            "subsystem_code": "-50",
            "title": "Indicating",
            "definition": "Refers to the portion of the system which is used to monitor the condition of fuel (quantity, temperature and pressure). It includes, for example, transmitters, indicators, wiring and pressure warning systems."
          },
          {
            "subsystem_code": "-60",
            "title": "Venting and de-fuelling",
            "definition": "Refers to the portion of the system which is used to vent fumes from the fuel system and to provide a means for removing/dumping unwanted fuel."
          }
        ]
      },
      {
        "table_id": "8",
        "system_code": "A5",
        "title": "Air and exhaust systems, General",
        "subsystems": [
          {
            "subsystem_code": "-00",
            "title": "General",
            "definition": "Refers to a system which supplies and filters air to the engine and collects and removes exhaust gases from the engine. It includes, for example, all filters, pipes, couplings, silencers, catalytic converters and ducting mounted externally to the power unit/pack."
          },
          {
            "subsystem_code": "-10",
            "title": "Air system",
            "definition": "Refers to a system which supplies and filters air to the engine. It includes, for example, pre-filters, main air filters, and associated ducting. It can also include air cooling/heating systems and intercoolers."
          },
          {
            "subsystem_code": "-20",
            "title": "Collector",
            "definition": "Refers to that portion of the system which collects exhaust gases from the engine manifold. It includes pipes, joints, gaskets, etc."
          },
          {
            "subsystem_code": "-30",
            "title": "Noise suppression",
            "definition": "Refers to that portion of the system which reduces noise produced by the engine exhaust gases. It includes silencers, baffles, shields, etc."
          },
          {
            "subsystem_code": "-40",
            "title": "Emission control",
            "definition": "Refers to that portion of the system which is designed to reduce or eliminate engine exhaust gas emissions. It includes, for example, catalytic converters and tail pipes."
          }
        ]
      },
      {
        "table_id": "9",
        "system_code": "A6",
        "title": "Lubrication systems, General",
        "subsystems": [
          {
            "subsystem_code": "-00",
            "title": "General",
            "definition": "This system includes lubrication storage facilities that are external to the engine/power pack. It includes delivery and return pipes, pumps, filters and heat exchangers mounted externally to the power unit/pack."
          },
          {
            "subsystem_code": "-10",
            "title": "Storage",
            "definition": "Refers to the part of the system used for storage of engine and/or transmission lubricating oil. It includes tanks, filling systems, sumps, drains, etc."
          },
          {
            "subsystem_code": "-20",
            "title": "Distribution",
            "definition": "Refers to the part of the system used for distribution of lubricating oil to and from the engine and/or transmission. It includes pipes, pumps, filters, valves, etc."
          },
          {
            "subsystem_code": "-30",
            "title": "Indicating",
            "definition": "Refers to the part of the system used to monitor the condition of engine and/or transmission lubricating oil (quantity, temperature and pressure). It includes transmitters, indicators, wiring, pressure warning systems, etc."
          }
        ]
      },
      {
        "table_id": "10",
        "system_code": "A7",
        "title": "Transmission, General",
        "subsystems": [
          {
            "subsystem_code": "-00",
            "title": "General",
            "definition": "Refers to a means to transmit power from the engine to the driving member and can include clutch, torque converter, and gearbox. It can also include steering and brakes if they are integral to the transmission. Also included are differentials and power takeoffs."
          },
          {
            "subsystem_code": "-10",
            "title": "Gearbox",
            "definition": "Refers to a means for varying the speed/torque delivered from the power unit to the driving member. It can include the steering control and brake assemblies."
          },
          {
            "subsystem_code": "-20",
            "title": "Steering control applied, assembly",
            "definition": "Refers to a discrete means for varying the drive through the transmission system, to each of the vehicle's driving members (eg, tracked vehicles)."
          },
          {
            "subsystem_code": "-30",
            "title": "Brake assembly",
            "definition": "Refers to a discrete means for applying braking forces through the vehicle transmission (eg, tracked vehicles)."
          },
          {
            "subsystem_code": "-40",
            "title": "Auxiliary drive/ power takeoff",
            "definition": "Refers to an auxiliary means of obtaining an output from the engine. It includes transfer gearboxes which can also include a slip differential."
          },
          {
            "subsystem_code": "-50",
            "title": "Clutch",
            "definition": "Refers to a means for engaging/disengaging the transmission to/from the engine, when fitted as a separate assembly (for clutches fitted to a flywheel, see A21000)."
          },
          {
            "subsystem_code": "-60",
            "title": "Drive shaft",
            "definition": "Refers to the means for connecting power output from the engine to the driving member. It includes muff couplings, propeller shafts, universal joints and final drives."
          },
          {
            "subsystem_code": "-70",
            "title": "Torque converter",
            "definition": "Refers to a means for varying the torque delivered from the engine to the driving member."
          },
          {
            "subsystem_code": "-80",
            "title": "Differential",
            "definition": "Refers to a means for changing the direction of rotation delivered from the engine to the driving member or wheels. For wheeled vehicles, it includes the driving axles, half shafts, hubs, etc."
          }
        ]
      },
      {
        "table_id": "11",
        "system_code": "A8",
        "title": "Automotive/ remote piloting and digital control systems, General",
        "subsystems": [
          {
            "subsystem_code": "-00",
            "title": "General",
            "definition": "The automotive and remote piloting and Digital Automotive Control System (DACS) element refers to that equipment (hardware/software) installed in the vehicle which is used to plan and control vehicle speed and direction either autonomously or via tele-operation. This includes equipment which senses, processes and displays imagery data such as stereo vision systems, laser scanners, multiple sensor fusion algorithms and processors, image enhancement algorithms and processors etc. This includes, for example, equipment which performs intelligence analysis and planning functions such as automated route planners, image understanding algorithms and processors, computer aided driving algorithms, DACS and processors."
          },
          {
            "subsystem_code": "-10",
            "title": "Control",
            "definition": "Refers to processing and control elements. It includes central processors, analogue/digital converters, associated software, memory boards, servo units, actuators, associated wiring, etc."
          },
          {
            "subsystem_code": "-20",
            "title": "Sensors",
            "definition": "Refers to sensors which are specifically associated with providing inputs to an automotive/remote piloting system or DACS."
          },
          {
            "subsystem_code": "-30",
            "title": "Indicators",
            "definition": "Refers to the part of the system used to indicate/monitor an automotive/remote piloting system or DACS. It includes indicators, wiring, etc."
          }
        ]
      },
      {
        "table_id": "12",
        "system_code": "A9",
        "title": "Controls (drivers), General",
        "subsystems": [
          {
            "subsystem_code": "-00",
            "title": "General",
            "definition": "Given in this element are the controls required to start, stop, steer and generally control the vehicle commensurate with the mobility role of the equipment. It includes, for example, on-board diagnostic systems."
          },
          {
            "subsystem_code": "-10",
            "title": "Foot controls",
            "definition": "Refers to the foot-operated controls to start, stop, steer and generally control the vehicle. It includes, for example, pedal assemblies (clutch, brake, accelerator, etc), associated linkages, cables, hydraulic/pneumatic connections, master and slave cylinders, brake shoes and pads and disks and drums."
          },
          {
            "subsystem_code": "-20",
            "title": "Hand controls",
            "definition": "Refers to the hand-operated controls to start, stop, steer and generally control the vehicle. It includes, for example, stop/start, steering (wheel, tiller, etc) and braking controls."
          },
          {
            "subsystem_code": "-30",
            "title": "Ancillary controls",
            "definition": "Refers to ancillary controls and associated systems. It includes, for example, such items as screen wash equipment, windscreen wipers and adjustable wing mirrors."
          },
          {
            "subsystem_code": "-40",
            "title": "Propulsion control systems",
            "definition": "Refers to systems which monitor and/or control engine speed and performance."
          },
          {
            "subsystem_code": "-50",
            "title": "Instrumentation",
            "definition": "Refers to systems (hardware/software) which monitor/report on the operation of vehicle systems. It includes, for example, the drivers instrumentation panel, warning lights and condition monitoring systems"
          }
        ]
      }
    ]
  },
  {
    "system_id": "B",
    "system_title": "Structure",
    "tables": [
      {
        "table_id": "13",
        "system_code": "B0",
        "title": "Structure, General",
        "subsystems": [
          {
            "subsystem_code": "-00",
            "title": "General",
            "definition": "Framework and/or basic structural housing for a system, including load bearing components."
          }
        ]
      },
      {
        "table_id": "14",
        "system_code": "B1",
        "title": "Hull/frame, General",
        "subsystems": [
          {
            "subsystem_code": "-00",
            "title": "General",
            "definition": "This element refers to the vehicles primary load bearing component which provides the structural integrity to withstand the operational loading stresses generated while traversing various terrain profiles. This element could be a simple wheeled vehicle frame or a more complicated combat vehicle hull which satisfies not only the structural requirements but also provides armor protection. It includes all structural subassemblies and appendages which attach directly to the primary structure. This element, for example, includes towing and lifting fittings, bumpers, hatches and grilles. It also includes provision to accommodate other subsystems such as mountings for suspension, weapons, turret, track body, cab, special equipment, loads etc."
          },
          {
            "subsystem_code": "-10",
            "title": "Internal mountings",
            "definition": "Refers to internal fitments mounted on the hull/frame. It includes brackets, stud welding, floors and insulation panels."
          },
          {
            "subsystem_code": "-20",
            "title": "External mountings",
            "definition": "Refers to the chassis and external fitments mounted on the hull/frame. It includes brackets, stud welding, steps, bumpers, mud-guards, windows, etc."
          },
          {
            "subsystem_code": "-30",
            "title": "Doors/hatches",
            "definition": "Refers to loading/entry hatches and doors in, or directly mounted on, the hull/frame assembly. It includes shell loading doors, driver and passenger doors, hatches, locks, handles, drivers/operators hoods, cowls and windshields, etc."
          },
          {
            "subsystem_code": "-40",
            "title": "Seats",
            "definition": "Refers to seating which is directly mounted on the hull/frame."
          },
          {
            "subsystem_code": "-50",
            "title": "Drinking water tank",
            "definition": "Refers to a system designed to provide drinking water for the driver and crew, which is directly mounted on the hull/frame. It includes tanks, filler necks, filters, pipes, seals, valves, vents, drainage, etc."
          },
          {
            "subsystem_code": "-60",
            "title": "Access cover plates",
            "definition": "Refers to access cover plates directly mounted on the hull/frame. It includes, for example, guards, plugs, drain/inspection covers. It can also include deck area assemblies."
          },
          {
            "subsystem_code": "-70",
            "title": "Gun crutch/ depression rails",
            "definition": "Refers to gun crutch and depression rails directly mounted on the hull/frame."
          },
          {
            "subsystem_code": "-80",
            "title": "Skirting plates/ brackets/splash plates",
            "definition": "Refers to skirting plates, brackets and splash plates directly mounted on the hull/frame. It includes the plates and associated fittings, brackets, towing attachments, etc."
          }
        ]
      },
      {
        "table_id": "15",
        "system_code": "B2",
        "title": "Body/cab, General",
        "subsystems": [
          {
            "subsystem_code": "-00",
            "title": "General",
            "definition": "The body/cab elements refer to the major components to be mated to a chassis or frame to provide a complete vehicle having a defined mission capability. This element includes accommodation for personnel, cargo, and such subsystems as need to be placed in proximity of the operators."
          },
          {
            "subsystem_code": "-10",
            "title": "Internal mountings",
            "definition": "Refers to internal fitments mounted on the body/cab. It includes panels, brackets, clips, fascia, instrument panels, stud welding, internal windows, etc."
          },
          {
            "subsystem_code": "-20",
            "title": "External mountings",
            "definition": "Refers to external fitments mounted on the body/cab. It includes the external cab assembly, panels, brackets, stud welding, steps, windows, cab tilt and locking mechanism, etc."
          },
          {
            "subsystem_code": "-30",
            "title": "Doors/hatches",
            "definition": "Refers to loading/entry hatches and doors in, or directly mounted on, the body/cab. It includes loading doors, driver and passenger doors, hatches, locks, handles, etc."
          },
          {
            "subsystem_code": "-40",
            "title": "Seats",
            "definition": "Refers to seating and associated fittings which are directly mounted on the body/cab. It includes, for example, seat belts and harnesses."
          },
          {
            "subsystem_code": "-50",
            "title": "Drinking water tank",
            "definition": "Refers to a system designed to provide drinking water for the driver and crew, which is directly mounted on the body/cab. It includes tanks, filler necks, filters, pipes, seals, valves, vents, drainage, etc."
          },
          {
            "subsystem_code": "-60",
            "title": "Access panels",
            "definition": "Refers to access panels directly mounted on the body/cab."
          },
          {
            "subsystem_code": "-70",
            "title": "Load bay",
            "definition": "Refers to load (or passenger) carrying areas in the body/cab and any soft/hard top covering, supports, etc."
          },
          {
            "subsystem_code": "-80",
            "title": "Ancillary",
            "definition": "Refers to ancillary controls, items and associated systems in, or directly mounted on, the body or cab."
          }
        ]
      },
      {
        "table_id": "16",
        "system_code": "B3",
        "title": "Suspension/track/wheels, General",
        "subsystems": [
          {
            "subsystem_code": "-00",
            "title": "General",
            "definition": "This element refers to the means for generating tractive effort, thrust and lift, generally at or in proximity to the earth's surface and adapting the vehicle to the irregularities of the surface. It includes, for example, wheels, tracks and steering gears for traction and control functions. Also, it includes springs, shock absorbers, skirts and other suspension members such as track adjusting mechanisms. It does not include specific steering mechanisms."
          },
          {
            "subsystem_code": "-10",
            "title": "Suspension unit",
            "definition": "Refers to the means for adapting the vehicle to irregularities of the surface. It includes hydrogas units, shock absorbers, leaf and coil springs, pneumatic suspension units, etc. Also included is the lift mechanism, skirts, etc, for hovercraft."
          },
          {
            "subsystem_code": "-20",
            "title": "Road wheel hub assembly",
            "definition": "Refers to a means for distributing the nominal ground pressure of the vehicle. On wheeled vehicles, it includes wheels that transfer tractive effort to the surface and rolling wheels. It includes road wheels, hub assemblies, tires, valves, inner-tubes, etc."
          },
          {
            "subsystem_code": "-30",
            "title": "Sprocket wheel assembly",
            "definition": "Refers to the sprocket drive wheels which transfer tractive effort to the track."
          },
          {
            "subsystem_code": "-40",
            "title": "Track assembly",
            "definition": "Refers to the track and associated linkages."
          },
          {
            "subsystem_code": "-50",
            "title": "Idler wheels",
            "definition": "Refers to the feed/guide mechanism(s) associated with track laying. It includes idler wheels and track tensioners."
          },
          {
            "subsystem_code": "-60",
            "title": "Roller assembly",
            "definition": "Refers to the track roller guide assemblies."
          },
          {
            "subsystem_code": "-70",
            "title": "Axle",
            "definition": "Refers to non-driving axles not covered under the transmission system. It includes axle arms, links, bearings, etc."
          }
        ]
      },
      {
        "table_id": "17",
        "system_code": "B4",
        "title": "Turret assembly, General",
        "subsystems": [
          {
            "subsystem_code": "-00",
            "title": "General",
            "definition": "The turret assembly refers to the structures and equipment installation required to provide the fighting compartment element of combat vehicles. This element includes turret armor, EMC shielding, turret rings, slip rings, attachments and appendages such as latches and cupolas, and accommodation for personnel, weapons and C³I."
          },
          {
            "subsystem_code": "-10",
            "title": "Internal mountings",
            "definition": "Refers to internal fitments mounted in the turret. It includes drinking water installations, periscope mountings, panels, brackets, clips, stud welding, etc."
          },
          {
            "subsystem_code": "-20",
            "title": "External mountings",
            "definition": "Refers to external fitments mounted on the turret. It includes brush deflector assemblies, cooler boxes, gun covers, splash curtains, panels, brackets, stud welding, etc."
          },
          {
            "subsystem_code": "-30",
            "title": "Hatches",
            "definition": "Refers to loading/entry hatches in, or directly mounted on, the turret. It includes loading hatches, crew hatches and associated locks, handles, fittings, etc. It does not include cupolas."
          },
          {
            "subsystem_code": "-40",
            "title": "Seats",
            "definition": "Refers to seating which is directly mounted in the turret."
          },
          {
            "subsystem_code": "-50",
            "title": "Ring assembly",
            "definition": "Refers to a circular track and roller/ball-race assembly designed to facilitate turret rotation."
          },
          {
            "subsystem_code": "-60",
            "title": "Cupola",
            "definition": "Refers to a roof aperture and domed hatch assembly, primarily for observation purposes. It can be capable of rotation, and can also provide access for entry/exit."
          },
          {
            "subsystem_code": "-70",
            "title": "Elevating/ the traversing gearbox",
            "definition": "Refers to elevating/traversing gearboxes mounted on turret wall."
          },
          {
            "subsystem_code": "-80",
            "title": "Turntable and assembly",
            "definition": "Refers to the turret turntable assembly. It includes drive roller assemblies, RBJ mountings, etc."
          },
          {
            "subsystem_code": "-90",
            "title": "Ancillary",
            "definition": "Refers to ancillary controls, items and associated systems in, or directly mounted on, the turret. It includes such items as wash/wipe equipment, turret and elevation locks, position indicators and adjustable mirrors, etc."
          }
        ]
      }
    ]
  },
  {
    "system_id": "C",
    "system_title": "Armaments",
    "tables": [
      {
        "table_id": "18",
        "system_code": "C0",
        "title": "Armaments, General",
        "subsystems": [
          {
            "subsystem_code": "-00",
            "title": "General",
            "definition": "A defensive or offensive system or equipment."
          }
        ]
      },
      {
        "table_id": "19",
        "system_code": "C1",
        "title": "Gun control systems, General",
        "subsystems": [
          {
            "subsystem_code": "-00",
            "title": "General",
            "definition": "The gun control element refers to that equipment (hardware/software) installed in the vehicle which provides intelligence necessary to power elevate and traverse the weapons systems and also to control via stabilization systems, and turret and gun drives, including gun position indicators and sensors."
          },
          {
            "subsystem_code": "-10",
            "title": "Installation",
            "definition": "Refers to the Gun Control Equipment (GCE) installation."
          },
          {
            "subsystem_code": "-20",
            "title": "Control panel",
            "definition": "Refers to control panels associated with FV GCE."
          },
          {
            "subsystem_code": "-30",
            "title": "Power supply",
            "definition": "Refers to power supply units associated with FV GCE."
          },
          {
            "subsystem_code": "-40",
            "title": "Switch units",
            "definition": "Refers to switch units associated with FV GCE. It includes trimming units, fire control switches, etc."
          },
          {
            "subsystem_code": "-50",
            "title": "Gun controller",
            "definition": "Refers to control systems associated with GCE. It includes controls for the gun, motor generators, metadynes, amplidynes, magnicons, and power amplifiers."
          },
          {
            "subsystem_code": "-60",
            "title": "Power motors",
            "definition": "Refers to gearbox drive motors, associated with GCE. It includes the power, elevation and traverse drive motors."
          },
          {
            "subsystem_code": "-70",
            "title": "Gyroscope assembly",
            "definition": "Refers to gyroscope assemblies associated with GCE."
          },
          {
            "subsystem_code": "-80",
            "title": "Ancillary",
            "definition": "Refers to ancillary GCE controls and associated systems. It includes such items as turnbuckle assemblies, traverse displacement units, fire control quadrants, inter-connecting boxes, wiring, connectors, etc."
          }
        ]
      },
      {
        "table_id": "20",
        "system_code": "C2",
        "title": "Fire control systems, General",
        "subsystems": [
          {
            "subsystem_code": "-00",
            "title": "General",
            "definition": "The fire control element refers to that equipment (hardware/software) installed in the vehicle which provides intelligence necessary for weapons delivery such as launching and firing. This element includes, for example, radar and other sensors necessary for search recognition, meteorological and/or tracking; controls and displays, fire control computers, and computer programs."
          },
          {
            "subsystem_code": "-10",
            "title": "Computer/ interface",
            "definition": "Refers to computer interface systems and equipment associated with fire control systems. It includes computer/interface units, program loading facilities, etc."
          },
          {
            "subsystem_code": "-20",
            "title": "Control/monitor",
            "definition": "Refers to control and monitoring equipment associated with the fire control systems."
          },
          {
            "subsystem_code": "-30",
            "title": "Filter units",
            "definition": "Refers to filter units associated with the fire control systems."
          },
          {
            "subsystem_code": "-40",
            "title": "Sensors",
            "definition": "Refers to sensors associated with the fire control systems. It includes sensors for elevation and traverse displacement, trunnion tilt, sighting angle, etc."
          },
          {
            "subsystem_code": "-50",
            "title": "Firing handles",
            "definition": "Refers to firing handles associated with the fire control systems."
          },
          {
            "subsystem_code": "-60",
            "title": "Fire control boxes",
            "definition": "Refers to control boxes associated with the fire control system. It includes the commander's, and gunner's control boxes, the loader's safety box, etc."
          },
          {
            "subsystem_code": "-70",
            "title": "Ancillary",
            "definition": "Refers to ancillary items and associated systems. It includes such items as junction boxes, cables, connectors, services, etc."
          }
        ]
      },
      {
        "table_id": "21",
        "system_code": "C3",
        "title": "Thermal imaging, General",
        "subsystems": [
          {
            "subsystem_code": "-00",
            "title": "General",
            "definition": "This element refers to that equipment (hardware/software) which provides a thermal picture for the crew to use for surveillance and weapon guidance. It includes thermal imaging sensor heads, drive units, processors, power supply units, and display units."
          },
          {
            "subsystem_code": "-10",
            "title": "Sensor",
            "definition": "Refers to sensors specifically associated with thermal imaging systems. It includes scanner head assemblies, IR telescopes, tilt sensors, focal telescopes, etc."
          },
          {
            "subsystem_code": "-20",
            "title": "Processing",
            "definition": "Refers to processing elements associated with thermal imaging systems. It includes symbology units, processors, etc."
          },
          {
            "subsystem_code": "-30",
            "title": "Display",
            "definition": "Refers to the display elements of a thermal imaging system. It includes binocular viewers, commander's and gunner's display units, display drive units, etc."
          },
          {
            "subsystem_code": "-40",
            "title": "Control",
            "definition": "Refers to the control elements of a thermal imaging system. It includes servo units, gunner's and commander's control units, etc."
          },
          {
            "subsystem_code": "-50",
            "title": "Converter units",
            "definition": "Refers to converter elements of a thermal imaging system. It includes isolating converter units, etc."
          },
          {
            "subsystem_code": "-60",
            "title": "Structure and framework",
            "definition": "Refers to framework and/or basic structural housing for a thermal imaging system, including load bearing components."
          },
          {
            "subsystem_code": "-70",
            "title": "Ancillary",
            "definition": "Refers to ancillary controls, items and associated systems related to thermal imaging systems. It includes such items as wash/wipe equipment, cables, connectors, services, etc."
          }
        ]
      },
      {
        "table_id": "22",
        "system_code": "C4",
        "title": "Thermal imaging cooling systems, General",
        "subsystems": [
          {
            "subsystem_code": "-00",
            "title": "General",
            "definition": "This element refers to that equipment which provides a cooling medium, for thermal images. It will include, for example, compressors, bottles, pipes, fans, mini coolers, air cleaning columns and sterling cycle cooling machines."
          },
          {
            "subsystem_code": "-10",
            "title": "Compressors",
            "definition": "Refers to the part of the system used to pressurize the cooling system. It includes motors, pumps, etc."
          },
          {
            "subsystem_code": "-20",
            "title": "Storage",
            "definition": "Refers to the part of the system used for storage of coolant. It includes tanks, filling systems, sumps, drains, etc."
          },
          {
            "subsystem_code": "-30",
            "title": "Distribution",
            "definition": "Refers to the part of the system used for distribution of coolant. It includes pipes, valves, etc."
          },
          {
            "subsystem_code": "-40",
            "title": "Indicating",
            "definition": "Refers to the part of the system used to monitor the condition of coolant (quantity, temperature and pressure). It includes transmitters, indicators, wiring, warning systems, etc."
          }
        ]
      },
      {
        "table_id": "23",
        "system_code": "C5",
        "title": "Optical sighting systems, General",
        "subsystems": [
          {
            "subsystem_code": "-00",
            "title": "General",
            "definition": "The optical element refers to the sighting systems for search, observation, identification, tracking, range-finding and will include sensors and displays associated with this system."
          },
          {
            "subsystem_code": "-10",
            "title": "Surveillance",
            "definition": "Refers to optical surveillance equipment. It includes such items as observation periscopes, etc."
          },
          {
            "subsystem_code": "-20",
            "title": "Sighting",
            "definition": "Refers to optical sighting equipment. It includes such items as sighting and aiming periscopes, etc."
          },
          {
            "subsystem_code": "-30",
            "title": "Reticle image projector",
            "definition": "Refers to a means for displaying a reticle image in/on the sighting device."
          },
          {
            "subsystem_code": "-40",
            "title": "Sighting unit",
            "definition": "Refers to a means for displaying a reticle image in the sighting device."
          },
          {
            "subsystem_code": "-50",
            "title": "Ancillary",
            "definition": "Refers to ancillary controls, items and associated systems related to optical sighting systems. It includes such items as wash/wipe equipment, cables, connectors, services, etc."
          }
        ]
      },
      {
        "table_id": "24",
        "system_code": "C6",
        "title": "Weapon/gun, General",
        "subsystems": [
          {
            "subsystem_code": "-00",
            "title": "General",
            "definition": "The weapon/gun element refers to the means for the launcher to deliver fire on hostile targets or for logistics and other vehicles to exercise self-defense. This element includes, for example, the main gun/elevating mass and secondary armaments such as small arms and mortars. Fire control, gun control, and optical systems are excluded."
          },
          {
            "subsystem_code": "-10",
            "title": "Barrel",
            "definition": "The barrel assembly provides initial guidance for launch of projectiles."
          },
          {
            "subsystem_code": "-20",
            "title": "Breech, the housing and pressure firing which mechanism equipment.",
            "definition": "Refers to a system which provides a means of access for projectile/case to enter the barrel. It also provides a seal and firing mechanism, together with the means by the breech and firing mechanism are housed within the It includes all associated housing items."
          },
          {
            "subsystem_code": "-30",
            "title": "Mountings",
            "definition": "Refers to the means for attaching the barrel assembly and can include the mountlet assembly as well as the means to balance the armament system. It also includes tripods and bipods."
          },
          {
            "subsystem_code": "-40",
            "title": "Recoil mechanism",
            "definition": "Refers to systems which provide a means for absorbing energy created by projectile launch. It includes recuperator and recoil assemblies, etc."
          },
          {
            "subsystem_code": "-50",
            "title": "Smoke discharger",
            "definition": "Refers to a means for dispersing smoke/fumes generated when a round is fired."
          },
          {
            "subsystem_code": "-60",
            "title": "Secondary armaments installation",
            "definition": "Refers to systems which provide a secondary armament installation."
          },
          {
            "subsystem_code": "-70",
            "title": "Sights",
            "definition": "Refers to a mechanical sighting system used on small arms, machine guns, man-portable launchers, etc."
          },
          {
            "subsystem_code": "-80",
            "title": "Ancillary",
            "definition": "Refers to ancillary items and associated systems. It includes, for example, such items as spare barrels and other parts, wallets, cleaning kits and sustained fire kits."
          }
        ]
      },
      {
        "table_id": "25",
        "system_code": "C7",
        "title": "Automatic loading systems, General",
        "subsystems": [
          {
            "subsystem_code": "-00",
            "title": "General",
            "definition": "The automatic loading element consists of that equipment (hardware/software) providing the means to select ammunition from a stored position in the vehicle, its transfer to and loading of the armament system. This element also includes the means to eject spent cases and misfired rounds. Components include all ammunition storage racks, transfer/lift mechanisms, ramming and ejecting mechanisms as well as specialized hydraulic and electrical controls."
          },
          {
            "subsystem_code": "-10",
            "title": "Storage (ready round)",
            "definition": "Refers to ammunition storage racks, bins, etc."
          },
          {
            "subsystem_code": "-20",
            "title": "Transfer/lift",
            "definition": "Refers to the means to select ammunition from a stored position in the vehicle and transfer it to the armament system. It includes transfer and lift mechanisms"
          },
          {
            "subsystem_code": "-30",
            "title": "Loading/ramming",
            "definition": "Refers to the means to loading the armament system. It includes ramming and ejecting mechanisms."
          },
          {
            "subsystem_code": "-40",
            "title": "Control",
            "definition": "Refers to the means to control loading the armament system. It includes specialized hydraulic and electrical controls and safety devices."
          }
        ]
      }
    ]
  },
  {
    "system_id": "D",
    "system_title": "Electrical systems",
    "tables": [
      {
        "table_id": "26",
        "system_code": "D0",
        "title": "Electrical systems, General",
        "subsystems": [
          {
            "subsystem_code": "-00",
            "title": "General",
            "definition": "A system or equipment for generation, distribution and/or control of electric power."
          }
        ]
      },
      {
        "table_id": "27",
        "system_code": "D1",
        "title": "Electrical systems (engine/power pack), General",
        "subsystems": [
          {
            "subsystem_code": "-00",
            "title": "General",
            "definition": "This element refers to the electrical or electronic systems for the engine/power pack. It will include wiring harnesses, line replaceable units (LRUs), sensors, lighting, batteries, generators, etc."
          },
          {
            "subsystem_code": "-10",
            "title": "Generating",
            "definition": "Refers to generating systems and equipment in the engine/power pack compartment that are not directly mounted on the engine/power-pack. It includes such items as alternators, dynamos, generator panels, etc."
          },
          {
            "subsystem_code": "-20",
            "title": "Batteries",
            "definition": "Refers to battery equipment mounted in the engine/power pack compartment. It includes such items as battery containers, lagging kits, battery assemblies, connecting straps, etc."
          },
          {
            "subsystem_code": "-30",
            "title": "Instrumentation",
            "definition": "Refers to instrumentation systems and equipment mounted in the engine/power pack compartment. It includes such items as tachometers, speedometers, indicating panels, electronic circuit panels, control transmitters, etc."
          },
          {
            "subsystem_code": "-40",
            "title": "Lights",
            "definition": "Refers to lighting systems and equipment mounted in the engine/power pack compartment. It includes such items as inspection lights, etc."
          },
          {
            "subsystem_code": "-50",
            "title": "Wiring",
            "definition": "Refers to wiring and cable looms mounted in the engine/power pack compartment. It includes looms, wires, harnesses, etc."
          },
          {
            "subsystem_code": "-60",
            "title": "Electrical equipment",
            "definition": "Refers to electrical equipment mounted in the engine/power pack compartment. It includes, for example, actuators, engine controls and ignition systems."
          },
          {
            "subsystem_code": "-70",
            "title": "Distribution",
            "definition": "Refers to electrical distribution systems and equipment mounted in the engine/power pack compartment. It includes such items as controllers, switches, relays, regulators, etc."
          },
          {
            "subsystem_code": "-80",
            "title": "Protection",
            "definition": "Refers to electrical protection systems and equipment mounted in the engine/power pack compartment. It includes such items as fuses, fusible links, trip switches, etc."
          },
          {
            "subsystem_code": "-90",
            "title": "Control",
            "definition": "Refers to control systems and equipment mounted in the engine/power pack compartment. It includes such items as controllers, switches, relays, regulators, etc."
          }
        ]
      },
      {
        "table_id": "28",
        "system_code": "D2",
        "title": "Electrical systems (hull/frame), General",
        "subsystems": [
          {
            "subsystem_code": "-00",
            "title": "General",
            "definition": "This element refers to the electrical or electronic systems for the hull and frame. It will include both internal and external wiring harnesses, junction and distribution boxes, line replaceable units (LRUs), sensors and lighting systems. It also includes the interfaces and connectors associated with the engine, power pack, generating and starting systems."
          },
          {
            "subsystem_code": "-10",
            "title": "Internal electrical systems",
            "definition": "Refers to the internal electrical or electronic systems mounted in the hull/frame. It will include, for example, wiring harnesses, LRUs, junction and distribution boxes. It also includes the interfaces and connectors associated with the engine, power pack, generating and starting systems."
          },
          {
            "subsystem_code": "-20",
            "title": "Batteries",
            "definition": "Refers to battery equipment related to the hull/frame. It includes such items as battery containers, lagging kits, battery assemblies, connecting straps, etc."
          },
          {
            "subsystem_code": "-30",
            "title": "Internal lights",
            "definition": "Refers to lighting systems mounted internally in the hull/frame."
          },
          {
            "subsystem_code": "-40",
            "title": "External electrical systems",
            "definition": "Refers to the electrical or electronic systems mounted externally on the hull/frame. It will include, for example, external lighting systems, horns and flashing beacons."
          },
          {
            "subsystem_code": "-50",
            "title": "Wiring",
            "definition": "Refers to wiring, cable looms and clips related to the hull/frame or associated with connecting to the engine/power pack. It includes looms, wires, clips, harnesses, connectors, etc."
          },
          {
            "subsystem_code": "-60",
            "title": "Electrical equipment",
            "definition": "Refers to electrical equipment related to the hull/frame. It includes, for example, actuators, wiper controls, heaters, cooking pots, horns, radio fittings and ancillary items."
          },
          {
            "subsystem_code": "-70",
            "title": "Distribution",
            "definition": "Refers to electrical distribution and interconnecting systems and equipment related to the hull/frame. It includes such items as controllers, switches, relays, regulators, etc."
          },
          {
            "subsystem_code": "-80",
            "title": "Protection",
            "definition": "Refers to electrical protection systems and equipment related to the hull/frame. It includes such items as fuses, fuse panels, fusible links, trip switches, etc."
          },
          {
            "subsystem_code": "-90",
            "title": "Control",
            "definition": "Refers to control systems and equipment related to the hull/frame. It includes such items as controllers, switches, relays, regulators, etc."
          }
        ]
      },
      {
        "table_id": "29",
        "system_code": "D3",
        "title": "Electrical systems (body/cab), General",
        "subsystems": [
          {
            "subsystem_code": "-00",
            "title": "General",
            "definition": "This element refers to the electrical or electronic systems for either the body/cab. It will include wiring harnesses, line replaceable units (LRUs), sensors and lighting systems."
          },
          {
            "subsystem_code": "-10",
            "title": "Generating",
            "definition": "Refers to generating systems and equipment related to the body/cab. It includes such items as generator control panels, etc."
          },
          {
            "subsystem_code": "-20",
            "title": "Batteries",
            "definition": "Refers to battery equipment related to the body/cab. It includes such items as battery containers, lagging kits, battery assemblies, connecting straps, etc."
          },
          {
            "subsystem_code": "-30",
            "title": "Instrumentation",
            "definition": "Refers to instrumentation systems and equipment related to the body cab. It includes such items as indicating panels, electronic circuit panels, control transmitters, etc."
          },
          {
            "subsystem_code": "-40",
            "title": "Lights",
            "definition": "Refers to lighting systems and equipment related to the body cab. It includes such items as inspection lights, head lights, spot lights, tail/side lights, indicators, panel lights, convoy lights, etc."
          },
          {
            "subsystem_code": "-50",
            "title": "Wiring",
            "definition": "Refers to wiring and cable looms related to the body/cab. It includes looms, wires, harnesses, earthing straps, etc."
          },
          {
            "subsystem_code": "-60",
            "title": "Electrical equipment",
            "definition": "Refers to electrical equipment related to the body/cab. It includes, for example, actuators, wiper controls, heaters, cooking pots and horns."
          },
          {
            "subsystem_code": "-70",
            "title": "Distribution",
            "definition": "Refers to electrical distribution systems and equipment related to the body/cab. It includes such items as controllers, switches, relays, regulators, etc."
          },
          {
            "subsystem_code": "-80",
            "title": "Protection",
            "definition": "Refers to electrical protection systems and equipment related to the body/cab. It includes such items as fuses, fuse panels, fusible links, trip switches, etc."
          },
          {
            "subsystem_code": "-90",
            "title": "Control",
            "definition": "Refers to control systems and equipment related to the body/cab. It includes such items as controllers, switches, relays, regulators, etc."
          }
        ]
      },
      {
        "table_id": "30",
        "system_code": "D4",
        "title": "Electrical systems (turret), General",
        "subsystems": [
          {
            "subsystem_code": "-00",
            "title": "General",
            "definition": "This element refers to the electrical or electronic systems for the turret. It will include wiring harnesses, line replaceable units (LRUs), sensors and lighting systems."
          },
          {
            "subsystem_code": "-10",
            "title": "Generating",
            "definition": "Refers to generating systems and equipment related to the turret. It includes such items as generator control panels, etc."
          },
          {
            "subsystem_code": "-20",
            "title": "Batteries",
            "definition": "Refers to battery equipment related to the turret. It includes such items as battery containers, lagging kits, battery assemblies, connecting straps, etc."
          },
          {
            "subsystem_code": "-30",
            "title": "Instrumentation",
            "definition": "Refers to instrumentation systems and equipment related to the turret. It includes such items as indicating panels, electronic circuit panels, control transmitters, etc."
          },
          {
            "subsystem_code": "-40",
            "title": "Lights",
            "definition": "Refers to lighting systems and equipment related to the turret. It includes such items as inspection lights, panel lights, roof lights, spot lights, convoy lights, etc."
          },
          {
            "subsystem_code": "-50",
            "title": "Wiring",
            "definition": "Refers to wiring and cable looms related to the turret. It includes looms, wires, harnesses, earthing straps, etc."
          },
          {
            "subsystem_code": "-60",
            "title": "Electrical equipment",
            "definition": "Refers to electrical equipment related to the turret. It includes, for example, actuators, wiper controls, heaters and cooking pots."
          },
          {
            "subsystem_code": "-70",
            "title": "Distribution",
            "definition": "Refers to electrical distribution systems and equipment related to the turret. It includes such items as controllers, switches, relays, regulators, etc."
          },
          {
            "subsystem_code": "-80",
            "title": "Protection",
            "definition": "Refers to electrical protection systems and equipment related to the turret. It includes such items as fuses, fuse panels, fusible links, trip switches, etc."
          },
          {
            "subsystem_code": "-90",
            "title": "Control",
            "definition": "Refers to control systems and equipment related to the turret. It includes such items as controllers, switches, relays, regulators, etc."
          }
        ]
      }
    ]
  },
  {
    "system_id": "E",
    "system_title": "Communications system",
    "tables": [
      {
        "table_id": "31",
        "system_code": "E0",
        "title": "Communications, General",
        "subsystems": [
          {
            "subsystem_code": "-00",
            "title": "General",
            "definition": "A system or equipment for transferring information."
          }
        ]
      },
      {
        "table_id": "32",
        "system_code": "E1",
        "title": "Communication systems, General",
        "subsystems": [
          {
            "subsystem_code": "-00",
            "title": "General",
            "definition": "The communications element refers to that equipment (hardware/software) which provides the means within the system for commanding, controlling and transmitting/receiving information and data to vehicle crew members and other personnel exterior to the operating vehicle. This element includes radio frequency equipment, microwave and optic communication links, networked equipment for multiple vehicle control and intercoms and external phones systems. It can include navigational system and data displays when these are integral with the equipment of crew stations or drivers for automotive display."
          },
          {
            "subsystem_code": "-10",
            "title": "UHF/SHF/EHF",
            "definition": "Refers to that portion of the system used for communications utilizing ultra, super and extra high frequency (UHF, SHF, EHF) carriers. It includes transmitters, receivers, control, antennas, etc."
          },
          {
            "subsystem_code": "-20",
            "title": "VHF",
            "definition": "Refers to that portion of the system used for communications utilizing very high frequency (VHF) carriers. It includes transmitters, receivers, control, antennas, etc."
          },
          {
            "subsystem_code": "-30",
            "title": "HF",
            "definition": "Refers to that portion of the system used for communications utilizing high frequency (HF) carriers. It includes transmitters, receivers, control, antennas, etc."
          },
          {
            "subsystem_code": "-40",
            "title": "LF",
            "definition": "Refers to that portion of the system used for communications utilizing low frequency (LF) carriers. It includes transmitters, receivers, control, antennas, etc."
          },
          {
            "subsystem_code": "-50",
            "title": "Audio",
            "definition": "Refers to that portion of the system used for voice communications. It includes such items as intercoms, headphones, loudspeakers, switching/control panels, etc."
          },
          {
            "subsystem_code": "-60",
            "title": "Digital",
            "definition": "Refers to that portion of the system used for digital/data communications. It includes modems, encryption devices, etc."
          },
          {
            "subsystem_code": "-70",
            "title": "Satellite",
            "definition": "Refers to that portion of the system used for communications via satellites. It includes transmitters, receivers, control, antennas, etc."
          },
          {
            "subsystem_code": "-80",
            "title": "Optical",
            "definition": "Refers to that portion of the system used for communications via line-of-site. It includes transmitters, receivers, control, signaling devices, etc."
          },
          {
            "subsystem_code": "-90",
            "title": "Ancillary",
            "definition": "Refers to ancillary controls and associated systems. It includes such items as wiring, connectors, etc."
          }
        ]
      },
      {
        "table_id": "33",
        "system_code": "E2",
        "title": "Identification friend/foe (IFF), General",
        "subsystems": [
          {
            "subsystem_code": "-00",
            "title": "General",
            "definition": "IFF equipment is common to all services and is therefore interactive with many other users. It covers the equipment (hardware software) that identifies friend or foe and transmits that information. It can use the vehicle communication system(s)."
          },
          {
            "subsystem_code": "-10",
            "title": "Transmitting",
            "definition": "Refers to that part of the system which is used to send data."
          },
          {
            "subsystem_code": "-20",
            "title": "Receiving",
            "definition": "Refers to that part of the system which is used to receive IFF data."
          },
          {
            "subsystem_code": "-30",
            "title": "Indicating",
            "definition": "Refers to that part of the system which is used to display IFF data."
          }
        ]
      }
    ]
  },
  {
    "system_id": "F",
    "system_title": "Navigation system",
    "tables": [
      {
        "table_id": "34",
        "system_code": "F0",
        "title": "Navigation, General",
        "subsystems": [
          {
            "subsystem_code": "-00",
            "title": "General",
            "definition": "A system or equipment used to determine, conduct, manage or plot a position or course for the system."
          }
        ]
      },
      {
        "table_id": "35",
        "system_code": "F1",
        "title": "Navigation systems, General",
        "subsystems": [
          {
            "subsystem_code": "-00",
            "title": "General",
            "definition": "The navigation element refers to that equipment (hardware/software) installed in the vehicle which permits the crew to determine vehicle location and to plot the course of the vehicle. It includes navigation systems such as dead reckoning, inertial and global positioning systems. Landmark recognition algorithms and processors are also included."
          },
          {
            "subsystem_code": "-10",
            "title": "Independent",
            "definition": "Refers to that portion of the system (hardware/software) which provides information to determine position and is independent on ground installations or orbiting satellites. It includes inertial guidance systems, tracking systems, sextants, etc."
          },
          {
            "subsystem_code": "-20",
            "title": "Dependant",
            "definition": "Refers to that portion of the system (hardware/software) which provides information to determine position and is mainly dependant on ground installations or orbiting satellites. It includes GPS, radio compass, etc."
          },
          {
            "subsystem_code": "-30",
            "title": "Computing",
            "definition": "Refers to that portion of the system (hardware/software) which combines/processes navigational data to compute or manage the vehicle's geographical position. It includes course computers, landmark recognition algorithms, processors, displays, etc."
          }
        ]
      }
    ]
  },
  {
    "system_id": "G",
    "system_title": "Surveillance system",
    "tables": [
      {
        "table_id": "36",
        "system_code": "G0",
        "title": "Surveillance, General",
        "subsystems": [
          {
            "subsystem_code": "-00",
            "title": "General",
            "definition": "A system or equipment used to sense the environment."
          }
        ]
      },
      {
        "table_id": "37",
        "system_code": "G1",
        "title": "Surveillance systems, General",
        "subsystems": [
          {
            "subsystem_code": "-00",
            "title": "General",
            "definition": "The surveillance element is defined as all equipment (hardware/software) and associated systems used to sense the surrounding environment and then process, display and record the resulting information. This can include, for example, Meteorological equipment. It does not include specific thermal imaging or meteorological/atmospheric systems."
          },
          {
            "subsystem_code": "-10",
            "title": "Control",
            "definition": "Refers to the processing, control and recording elements of the sensor systems. It includes central processors, analogue/digital converters, associated software, storage units, etc."
          },
          {
            "subsystem_code": "-20",
            "title": "Indicating",
            "definition": "Refers to the part of the system used to indicate/monitor sensor information. It includes data identification, indicators, displays panels, etc."
          },
          {
            "subsystem_code": "-30",
            "title": "Recording",
            "definition": "Refers to the part of the system used to record sensor information."
          },
          {
            "subsystem_code": "-40",
            "title": "Optical/infra-red",
            "definition": "Refers to that portion of a system that uses optical and/or heat-sensing devices to acquire information. It includes, for example, driver's, commander's and gunner's periscopes, infra-red scanners, heat sensors and image intensifiers. It does not include specific thermal imaging systems or sighting equipment."
          },
          {
            "subsystem_code": "-50",
            "title": "Laser",
            "definition": "Refers to that portion of a system that uses laser devices to acquire information. It includes distance measuring, target identification, etc."
          },
          {
            "subsystem_code": "-60",
            "title": "Radar",
            "definition": "Refers to that portion of a system that uses radar devices to acquire information. It includes antennas, receivers, transmitters, indicators, etc."
          },
          {
            "subsystem_code": "-70",
            "title": "Magnetic",
            "definition": "Refers to that portion of a system that uses magnetic sensors to acquire information. It includes magnetometers, amplifiers, processors, indicators, etc."
          },
          {
            "subsystem_code": "-80",
            "title": "Sonar",
            "definition": "Refers to that portion of a system that uses sonar to acquire information. It includes modulators, transducers, processors, indicators, etc."
          },
          {
            "subsystem_code": "-90",
            "title": "Acoustic",
            "definition": "Refers to that portion of a system that uses sound to acquire information. It includes listening devices, amplifiers, processors, indicators, etc."
          }
        ]
      },
      {
        "table_id": "38",
        "system_code": "G2",
        "title": "Meteorological/atmospheric research, General",
        "subsystems": [
          {
            "subsystem_code": "-00",
            "title": "General",
            "definition": "Refers to the systems and devices which furnish a means of providing, processing and recording meteorological data."
          },
          {
            "subsystem_code": "-10",
            "title": "Weather",
            "definition": "Refers to that portion of a system which is used to detect, measure, process or record weather (moisture, temperature, cloud, wind, etc) data. It includes hygrometers, thermometers, anemometers, etc."
          },
          {
            "subsystem_code": "-20",
            "title": "Air turbulence",
            "definition": "Refers to that portion of a system which is used to detect, measure, process or record air turbulence data."
          },
          {
            "subsystem_code": "-30",
            "title": "Pollutants",
            "definition": "Refers to that portion of a system which is used to detect, measure, process or record contaminated particles."
          },
          {
            "subsystem_code": "-40",
            "title": "Magnetic/ gravitational",
            "definition": "Refers to that portion of a system which is used to detect, measure, process or record the earth's magnetic or gravitational forces."
          }
        ]
      }
    ]
  },
  {
    "system_id": "H",
    "system_title": "Steering system",
    "tables": [
      {
        "table_id": "39",
        "system_code": "H0",
        "title": "Steering, General",
        "subsystems": [
          {
            "subsystem_code": "-00",
            "title": "General",
            "definition": "A system or equipment used to guide or govern direction."
          }
        ]
      },
      {
        "table_id": "40",
        "system_code": "H1",
        "title": "Steering systems, General",
        "subsystems": [
          {
            "subsystem_code": "-00",
            "title": "General",
            "definition": "This element refers to the devices (hardware/software) which are part of the vehicle not contained within the suspension system or driver controls that govern the vehicle's direction. This will include, for example, rudder and thrust devices and trim valves for amphibians."
          },
          {
            "subsystem_code": "-10",
            "title": "Rudders",
            "definition": "Refers to rudder devices designed to control the vehicle's direction."
          },
          {
            "subsystem_code": "-20",
            "title": "Trim valves",
            "definition": "Refers to trim valves designed to control the vehicle's direction."
          },
          {
            "subsystem_code": "-30",
            "title": "Thrusters",
            "definition": "Refers to thrust devices designed to control the vehicle's direction."
          }
        ]
      }
    ]
  },
  {
    "system_id": "J",
    "system_title": "Ventilation/heating/cooling system",
    "tables": [
      {
        "table_id": "41",
        "system_code": "J0",
        "title": "Ventilation/heating/cooling, General",
        "subsystems": [
          {
            "subsystem_code": "-00",
            "title": "General",
            "definition": "A system or equipment used to provide a controlled environment."
          }
        ]
      },
      {
        "table_id": "42",
        "system_code": "J1",
        "title": "Ventilation/heating/cooling systems, General",
        "subsystems": [
          {
            "subsystem_code": "-00",
            "title": "General",
            "definition": "This element refers to those subassemblies or components which provide a micro-climatic condition (heating or cooling), inside the vehicle, including personnel heating/cooling suits or components. It also covers purification systems not covered by NBC."
          },
          {
            "subsystem_code": "-10",
            "title": "Compression",
            "definition": "That portion of the system and its controls which supplies pressurized air/gas. Includes items such as controls and indicating systems related to pressure, gas-filled systems, etc."
          },
          {
            "subsystem_code": "-20",
            "title": "Distribution",
            "definition": "That portion of the system used to induct and distribute air. It includes equipment rack cooling, seals, demisting, waveguide pressurization system and items of such systems, like blowers, ducting and inlets."
          },
          {
            "subsystem_code": "-30",
            "title": "Heating",
            "definition": "That portion of the system and its controls which supply heated air. It includes items such as heater units, wiring, etc."
          },
          {
            "subsystem_code": "-40",
            "title": "Cooling",
            "definition": "That portion of the system and its controls which supply cooled air. Includes items such as the cooling unit, indicating systems related to the cooler operation, wiring etc. It does not include temperature control and indicating systems."
          },
          {
            "subsystem_code": "-50",
            "title": "Temperature control",
            "definition": "That portion of the system used to control the temperature of the air. Includes items such as, thermal sensing devices, switches, indicators, wiring etc."
          },
          {
            "subsystem_code": "-60",
            "title": "Moisture/air",
            "definition": "That portion of the system used to contaminant control moisture in the air, to control ozone concentrations, to filter radioactive debris and chemical/biological contaminants, etc."
          },
          {
            "subsystem_code": "-70",
            "title": "Liquid coolant",
            "definition": "Those components required to supply liquid coolant to a cooling system."
          }
        ]
      }
    ]
  },
  {
    "system_id": "K",
    "system_title": "Hydraulic systems system",
    "tables": [
      {
        "table_id": "43",
        "system_code": "K0",
        "title": "Hydraulic systems, General",
        "subsystems": [
          {
            "subsystem_code": "-00",
            "title": "General",
            "definition": "A system or equipment for generation, distribution and/or control of hydraulic (or pneumatic) power."
          }
        ]
      },
      {
        "table_id": "44",
        "system_code": "K1",
        "title": "Hydraulics, General",
        "subsystems": [
          {
            "subsystem_code": "-00",
            "title": "General",
            "definition": "This element refers to a system or equipment (hardware/software) within the vehicle for the generation, distribution and/or control of hydraulic power."
          },
          {
            "subsystem_code": "-10",
            "title": "Main",
            "definition": "Refers to a system or equipment which is used to generate, store, distribute or control hydraulic power. It includes such items as tanks, valves, pumps, oil coolers, plumbing, etc. It does not include user systems classified elsewhere, or their connecting valves."
          },
          {
            "subsystem_code": "-20",
            "title": "Auxiliary",
            "definition": "Refers to that portion of the hydraulic system which is classified as auxiliary, emergency or standby and which is used to supplement, or replace the main hydraulic system."
          },
          {
            "subsystem_code": "-30",
            "title": "Indicating",
            "definition": "Refers to that part of the hydraulic system which is used to monitor the condition of the hydraulic system or fluid. It includes transmitters, indicators, warning systems, etc."
          }
        ]
      },
      {
        "table_id": "45",
        "system_code": "K2",
        "title": "Pneumatic systems, General",
        "subsystems": [
          {
            "subsystem_code": "-00",
            "title": "General",
            "definition": "This element refers to a system or equipment (hardware/software) within the vehicle for the generation, distribution and or control of pneumatic (including vacuum) power."
          },
          {
            "subsystem_code": "-10",
            "title": "Main",
            "definition": "Refers to a system or equipment which is used to generate, store, distribute or control pneumatic power. It includes such items as tanks, valves, pumps, plumbing, etc. It does not include user systems classified elsewhere, or their connecting valves."
          },
          {
            "subsystem_code": "-20",
            "title": "Auxiliary",
            "definition": "Refers to that part of the pneumatic system which is classified as auxiliary, emergency or standby and which is used to supplement, or replace the main pneumatic system."
          },
          {
            "subsystem_code": "-30",
            "title": "Indicating",
            "definition": "Refers to that part of the pneumatic system which is used to monitor the condition of the system. It includes transmitters, indicators, warning systems, etc."
          }
        ]
      }
    ]
  },
  {
    "system_id": "L",
    "system_title": "Electronic system",
    "tables": [
      {
        "table_id": "46",
        "system_code": "L0",
        "title": "Electronic system, General",
        "subsystems": [
          {
            "subsystem_code": "-00",
            "title": "General",
            "definition": "A system or equipment using electronic/automated software and/or firmware elements not specifically included in other systems."
          }
        ]
      },
      {
        "table_id": "47",
        "system_code": "L1",
        "title": "Electronics, General",
        "subsystems": [
          {
            "subsystem_code": "-00",
            "title": "General",
            "definition": "This element refers to a system or equipment within the vehicle which uses electronic/automated software and/or firmware elements not specifically included in any other systems."
          }
        ]
      }
    ]
  },
  {
    "system_id": "M",
    "system_title": "Auxiliary system",
    "tables": [
      {
        "table_id": "48",
        "system_code": "M0",
        "title": "Auxiliary, General",
        "subsystems": [
          {
            "subsystem_code": "-00",
            "title": "General",
            "definition": "Subsidiary systems that provide services or support to main systems or equipment."
          }
        ]
      },
      {
        "table_id": "49",
        "system_code": "M1",
        "title": "Auxiliary systems, General",
        "subsystems": [
          {
            "subsystem_code": "-00",
            "title": "General",
            "definition": "This element refers to subsidiary systems (hardware/software) that provide services or support to main systems or equipment within the vehicle, not covered elsewhere."
          }
        ]
      }
    ]
  },
  {
    "system_id": "N",
    "system_title": "Survivability system",
    "tables": [
      {
        "table_id": "50",
        "system_code": "N0",
        "title": "Survivability, General",
        "subsystems": [
          {
            "subsystem_code": "-00",
            "title": "General",
            "definition": "A system or equipment used to provide hazard detection, protection, survivability and escape facilities."
          }
        ]
      },
      {
        "table_id": "51",
        "system_code": "N1",
        "title": "Fire protection systems, General",
        "subsystems": [
          {
            "subsystem_code": "-00",
            "title": "General",
            "definition": "This element refers to systems (hardware/software) that provide a warning to the crew that a possible fire hazard exists. It includes the suppression/fire fighting and heat sensors required for this system."
          },
          {
            "subsystem_code": "-10",
            "title": "Detecting",
            "definition": "Refers to that part of the system which is used to sense the presence of excessive heat, smoke or fire."
          },
          {
            "subsystem_code": "-20",
            "title": "Indicating",
            "definition": "Refers to that part of the system which is used to indicate the presence of excessive heat, smoke or fire."
          },
          {
            "subsystem_code": "-30",
            "title": "Extinguishing",
            "definition": "Refers to that part of the system, either fixed or portable, which is used to extinguish fire."
          }
        ]
      },
      {
        "table_id": "52",
        "system_code": "N2",
        "title": "Nuclear, biological, chemical, General",
        "subsystems": [
          {
            "subsystem_code": "-00",
            "title": "General",
            "definition": "The NBC element refers to those subassemblies or components which provide nuclear, biological and chemical detection, protection and survivability to the vehicle or crew, either individually or collectively, during an NBC attack. This includes a positive pressure system, purification system, ventilated face piece (mask), NBC detection and warning devices, decontamination equipment and chemical resistant coatings. It can also include environmental control equipment, such as heaters, coolers, etc."
          },
          {
            "subsystem_code": "-10",
            "title": "Pack",
            "definition": "Refers to NBC protection packs."
          },
          {
            "subsystem_code": "-20",
            "title": "Control",
            "definition": "Refers to NBC protection controls."
          },
          {
            "subsystem_code": "-30",
            "title": "Pressure relief",
            "definition": "Refers to pressure relief devices specifically fitted for NBC protection purposes."
          },
          {
            "subsystem_code": "-40",
            "title": "Door assemblies",
            "definition": "Refers to NBC protection fitted to doors and hatches."
          },
          {
            "subsystem_code": "-50",
            "title": "Ancillary",
            "definition": "Refers to ancillary controls and associated systems. It can include, for example, such items as wiring, connectors, heaters, coolers and ducting."
          }
        ]
      }
    ]
  },
  {
    "system_id": "P",
    "system_title": "Special equipment/systems, General",
    "tables": [
      {
        "table_id": "53",
        "system_code": "P0",
        "title": "Special equipment/ systems, General",
        "subsystems": [
          {
            "subsystem_code": "-00",
            "title": "General",
            "definition": "A system or equipment used to provide a special mission capability."
          }
        ]
      },
      {
        "table_id": "54",
        "system_code": "P1",
        "title": "Special to type equipment, General",
        "subsystems": [
          {
            "subsystem_code": "-00",
            "title": "General",
            "definition": "This element refers to that special equipment (hardware/software) to be mated to a hull/turret or to a chassis/frame/body/cab assembly, to enable the achievement of a special mission capability. It includes blades, booms, cranes, winches, robotic arms, manipulators, etc."
          },
          {
            "subsystem_code": "-10",
            "title": "Structure",
            "definition": "Refers to that special hardware to be mated to a main assembly (hull, turret, chassis, frame, body or cab). It can include, for example, slide and tilt frames, launch frames and their winches, launch rails, bipods and platforms."
          },
          {
            "subsystem_code": "-20",
            "title": "Electrical systems",
            "definition": "Refers to electrical systems associated with special hardware that is mated to a main assembly. It can include, for example, launch/recovery mechanism electrical systems."
          },
          {
            "subsystem_code": "-30",
            "title": "Hydraulics",
            "definition": "Refers to hydraulic systems associated with special hardware that is mated to a main assembly. It can include, for example, the generation, distribution and control systems."
          },
          {
            "subsystem_code": "-40",
            "title": "Handling equipment",
            "definition": "Refers to handling equipment or systems that are mated to a main assembly. It can include, for example, cranes, winches, base stabilizers, support tools and actuators."
          },
          {
            "subsystem_code": "-50",
            "title": "Ancillary",
            "definition": "Refers to ancillary equipment for a system that is mated to a main assembly. It can include, for example, cradles, special tools, lifting beams and restraints."
          },
          {
            "subsystem_code": "-60",
            "title": "Stowage",
            "definition": "Refers to stowage provisions for operational equipment that are provided on a main assembly."
          }
        ]
      },
      {
        "table_id": "55",
        "system_code": "P2",
        "title": "Special recovery equipment, General",
        "subsystems": [
          {
            "subsystem_code": "-00",
            "title": "General",
            "definition": "This element refers to that special recovery equipment (hardware/software) to be mated to a hull turret or to a chassis/frame/body/cab assembly, to enable the achievement of a recovery capability. It includes cranes and towing equipment."
          }
        ]
      },
      {
        "table_id": "56",
        "system_code": "P3",
        "title": "Special fit equipment, General",
        "subsystems": [
          {
            "subsystem_code": "-00",
            "title": "General",
            "definition": "This element refers to that special fit equipment (hardware/software) to be mated to a hull/turret or to a chassis/frame/body/cab assembly, to enable the achievement of a specialized capability. It will include supply, DROPS, lift trucks, side loaders, etc."
          }
        ]
      },
      {
        "table_id": "57",
        "system_code": "P4",
        "title": "Special purpose equipment, General",
        "subsystems": [
          {
            "subsystem_code": "-00",
            "title": "General",
            "definition": "This element refers to that special-to-purpose equipment (hardware/software) to be mated to a hull/turret or to a chassis/frame/body/cab assembly, for the achievement of a special mission purpose. It covers, for example, ISO container bodies and equipment for command or repair workshop, medical and other special purpose vehicles."
          }
        ]
      }
    ]
  },
  {
    "system_id": "Q",
    "system_title": "Outfit, furnishings and stowage, General",
    "tables": [
      {
        "table_id": "58",
        "system_code": "Q0",
        "title": "Outfit, furnishings and stowage, General",
        "subsystems": [
          {
            "subsystem_code": "-00",
            "title": "General",
            "definition": "A function or equipment used to provide habitability, operability or stowage facilities that is not specifically included in other systems."
          }
        ]
      },
      {
        "table_id": "59",
        "system_code": "Q1",
        "title": "Stowage, General",
        "subsystems": [
          {
            "subsystem_code": "-00",
            "title": "General",
            "definition": "This element is required to provide for personal equipment stowage as well as operational equipment stowage on the vehicle including hull and turret."
          },
          {
            "subsystem_code": "-10",
            "title": "Charge bin",
            "definition": "Refers to charge bin stowage facilities."
          },
          {
            "subsystem_code": "-20",
            "title": "Shell stowage",
            "definition": "Refers to shell stowage facilities."
          },
          {
            "subsystem_code": "-30",
            "title": "Ammunition",
            "definition": "Refers to stowage facilities for both secondary and personal ammunition."
          },
          {
            "subsystem_code": "-40",
            "title": "Body/cab internal",
            "definition": "Refers to stowage facilities within the body or cab."
          },
          {
            "subsystem_code": "-50",
            "title": "Body/cab external",
            "definition": "Refers to stowage facilities mounted on the body or cab."
          },
          {
            "subsystem_code": "-60",
            "title": "Hull/frame internal",
            "definition": "Refers to stowage facilities mounted internally to the hull or frame. It includes, for example, the drivers, fighting, crew and engine/transmission compartments."
          },
          {
            "subsystem_code": "-70",
            "title": "Hull/frame external",
            "definition": "Refers to stowage facilities mounted externally on the hull or frame."
          },
          {
            "subsystem_code": "-80",
            "title": "Turret internal",
            "definition": "Refers to stowage facilities mounted internally to the turret."
          },
          {
            "subsystem_code": "-90",
            "title": "Turret external",
            "definition": "Refers to stowage facilities mounted externally on the turret."
          }
        ]
      },
      {
        "table_id": "60",
        "system_code": "Q2",
        "title": "Complete equipment schedule (CES), General",
        "subsystems": [
          {
            "subsystem_code": "-00",
            "title": "General",
            "definition": "This element refers to lists detailing the equipment required by the user to operate and maintain the system. It includes, for example, both fitted and loose items, spares, tools and operator manuals."
          },
          {
            "subsystem_code": "-10",
            "title": "Production ces",
            "definition": "This element refers to the production version of the CES."
          },
          {
            "subsystem_code": "-20",
            "title": "Service ces",
            "definition": "This element refers to the service version of the CES."
          },
          {
            "subsystem_code": "-30",
            "title": "Complex ces",
            "definition": "This element refers to the complex version of the CES."
          }
        ]
      }
    ]
  },
  {
    "system_id": "R",
    "system_title": "Training, General",
    "tables": [
      {
        "table_id": "61",
        "system_code": "R0",
        "title": "Training, General",
        "subsystems": [
          {
            "subsystem_code": "-00",
            "title": "General",
            "definition": "The training element is defined as the deliverable training services, devices, accessories, aids, equipment and facilities used to provide instruction through which personnel will acquire sufficient concepts, skills and aptitudes to both operate and maintain the system with maximum efficiency. This element includes all effort associated design, development and production of deliverable training equipment as well as the execution of training services."
          }
        ]
      },
      {
        "table_id": "62",
        "system_code": "R1",
        "title": "Training services, General",
        "subsystems": [
          {
            "subsystem_code": "-00",
            "title": "General",
            "definition": "The training services element refers to the deliverable training services, used to provide instruction through which personnel will acquire sufficient concepts, skills and aptitudes to both operate and maintain the system with maximum efficiency."
          },
          {
            "subsystem_code": "-10",
            "title": "Devices/ accessories/aids",
            "definition": "The training devices/accessories/aids element refers to the deliverable devices, accessories and aids used to provide instruction through which personnel will acquire sufficient concepts, skills and aptitudes to both operate and maintain the system with maximum efficiency."
          },
          {
            "subsystem_code": "-20",
            "title": "Equipment",
            "definition": "The training equipment element refers to the deliverable training equipment used to provide instruction through which personnel will acquire sufficient concepts, skills and aptitudes to both operate and maintain the system with maximum efficiency."
          },
          {
            "subsystem_code": "-30",
            "title": "Facilities",
            "definition": "The training facilities element refers to the deliverable training facilities used to provide instruction through which personnel will acquire sufficient concepts, skills and aptitudes to both operate and maintain the system with maximum efficiency."
          }
        ]
      }
    ]
  },
  {
    "system_id": "S",
    "system_title": "Repair Test and Support, General",
    "tables": [
      {
        "table_id": "63",
        "system_code": "S0",
        "title": "Repair test and support, General",
        "subsystems": [
          {
            "subsystem_code": "-00",
            "title": "General",
            "definition": "A system, equipment or facilities used to maintain operational capability."
          }
        ]
      },
      {
        "table_id": "64",
        "system_code": "S1",
        "title": "Power pack repair facility (PPRF), General",
        "subsystems": [
          {
            "subsystem_code": "-00",
            "title": "General",
            "definition": "This element refers to a facility which will allow unserviceable vehicle power packs to be repaired, including major assembly exchange, tested and returned to service use. PPRFs can be transportable and will include tools, jigs and fixtures commensurate with the type of equipment they are due to repair."
          },
          {
            "subsystem_code": "-10",
            "title": "Mobile",
            "definition": "This element refers to a mobile facility which will allow unserviceable vehicle power packs to be repaired, including major assembly exchange, tested and returned to service use. This section will not include the basic container body and its associated equipment."
          },
          {
            "subsystem_code": "-20",
            "title": "Fixed",
            "definition": "This element refers to a static facility which will allow unserviceable vehicle power packs to be repaired, including major assembly exchange, tested and returned to service use."
          }
        ]
      },
      {
        "table_id": "65",
        "system_code": "S2",
        "title": "Sighting systems repair facility, General",
        "subsystems": [
          {
            "subsystem_code": "-00",
            "title": "General",
            "definition": "This element refers to equipment (hardware/software) that enables the repair, test or calibration of the optical sighting equipment, including laser range finders for example."
          },
          {
            "subsystem_code": "-10",
            "title": "Mobile",
            "definition": "Refers to mobile (man-portable or vehicle mounted) equipment (hardware/software), which can be in a vehicle container or box body, that enables the repair, test and/or calibration of optical sighting equipment."
          },
          {
            "subsystem_code": "-20",
            "title": "Fixed",
            "definition": "Refers to static (permanent or temporary) equipment (hardware/software) that enables the repair, test or calibration of optical sighting equipment."
          }
        ]
      },
      {
        "table_id": "66",
        "system_code": "S3",
        "title": "Thermal imaging repair facility, General",
        "subsystems": [
          {
            "subsystem_code": "-00",
            "title": "General",
            "definition": "To provide a transportable facility (hardware/software) whereby thermal imaging equipment including its associated cooling systems can be repaired, tested and returned to service. The equipment covered will include, for example, clean air equipment, jigs, fixtures, computer interface adapters and test equipment."
          },
          {
            "subsystem_code": "-10",
            "title": "Mobile",
            "definition": "Refers to mobile (man-portable or vehicle mounted) equipment (hardware/software), which can be in a vehicle container or box body, that enables the repair, test and/or calibration of thermal imaging equipment."
          },
          {
            "subsystem_code": "-20",
            "title": "Fixed",
            "definition": "Refers to static (permanent or temporary) equipment (hardware/software) that enables the repair, test or calibration of thermal imaging equipment."
          }
        ]
      },
      {
        "table_id": "67",
        "system_code": "S4",
        "title": "General purpose electronic repair facility, General",
        "subsystems": [
          {
            "subsystem_code": "-00",
            "title": "General",
            "definition": "This element refers to equipment (hardware/software) that enables unserviceable electrical/electronic items to be repaired, tested and returned to service use."
          },
          {
            "subsystem_code": "-10",
            "title": "Mobile",
            "definition": "Refers to mobile (man-portable or vehicle mounted) equipment (hardware/software), which can be in a vehicle container or box body, that enables the repair, test and/r calibration of general purpose electronic equipment."
          },
          {
            "subsystem_code": "-20",
            "title": "Fixed",
            "definition": "Refers to static (permanent or temporary) equipment (hardware/software) that enables the repair, test or calibration of general purpose electronic equipment."
          }
        ]
      },
      {
        "table_id": "68",
        "system_code": "S5",
        "title": "Common support equipment, General",
        "subsystems": [
          {
            "subsystem_code": "-00",
            "title": "General",
            "definition": "The common support equipment element refers to those items required to support and maintain the system or portions of the systems while not directly engaged in the performance of its mission, and which are presently in the MOD inventory for support of other systems. This element includes all efforts required to assure the availability of this equipment for support of the particular defense product item. It also includes the acquisition of additional quantities of this equipment if caused by the introduction of the defense material item into operational service."
          }
        ]
      }
    ]
  }
]
